
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>nice ·  呼吸君のGitBook </title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Bre Athy">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-lightbox/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="task_struct.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.zhihu.com/people/you-yi-shi-de-hu-xi/activities" target="_blank" class="custom-link">Home</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    简介
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../要求.html">
            
                <a href="../要求.html">
            
                    
                    实验一
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1.1" data-path="../过程.html">
            
                <a href="../过程.html">
            
                    
                    实验过程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.1.2" data-path="../实验报告.html">
            
                <a href="../实验报告.html">
            
                    
                    实验报告
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.1.3" >
            
                <span>
            
                    
                    参考资料
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.1.1.3.1" data-path="nice.html">
            
                <a href="nice.html">
            
                    
                    nice
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.1.3.2" data-path="task_struct.html">
            
                <a href="task_struct.html">
            
                    
                    task_struct
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../../实验二/过程.html">
            
                <a href="../../实验二/过程.html">
            
                    
                    实验二
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >nice</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <html><head></head><body><h1 id="&#x9884;&#x5907;&#x77E5;&#x8BC6;">&#x9884;&#x5907;&#x77E5;&#x8BC6;</h1>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;ps -l&#x770B;&#x5230;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;:</p>
<p><a href="https://i.loli.net/2019/04/03/5ca47ee67e677.png" data-lightbox="96df7b18-2d62-4bde-b36b-37030a3c61e8" data-title="" target="_blank"><img src="https://i.loli.net/2019/04/03/5ca47ee67e677.png" alt=""></a></p>
<p>&#x5176;&#x4E2D;,</p>
<ul>
<li>F&#xFF1A;&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x65D7;&#x6807;&#xFF0C;&#x6807;&#x8BC6;&#x8FDB;&#x7A0B;&#x6240;&#x62E5;&#x6709;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x5F53;&#x6211;&#x5207;&#x6362;&#x5230;root&#x7684;&#x65F6;&#x5019;&#x4E3A;4&#x8868;&#x793A;&#x62E5;&#x6709;root&#x6743;&#x9650;&#xFF0C;&#x4E3A;1&#x4EC5;&#x6709;fork()&#x6743;&#x9650;</li>
<li>S&#xFF1A;&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x5F53;&#x524D;&#x7684;&#x72B6;&#x6001;<ul>
<li>R&#xFF1A;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;(RUNNING)</li>
<li>S&#xFF1A;&#x7761;&#x7720;(SLEEP)</li>
<li>D&#xFF1A;&#x4E0D;&#x53EF;&#x4E2D;&#x65AD;</li>
<li>T&#xFF1A;&#x505C;&#x6B62;(STOP)</li>
<li>Z&#xFF1A;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;(ZOMBIE)</li>
</ul>
</li>
<li>UID&#xFF1A;&#x62E5;&#x6709;&#x8BE5;&#x8FDB;&#x7A0B;&#x7528;&#x6237;&#x7684;&#x7528;&#x6237;ID</li>
<li>PID&#xFF1A;&#x8FDB;&#x7A0B;&#x53F7;</li>
<li>PPID&#xFF1A;&#x8BE5;&#x8FDB;&#x7A0B;&#x7236;&#x8FDB;&#x7A0B;&#x7684;&#x8FDB;&#x7A0B;&#x597D;</li>
<li>C&#xFF1A;CPU&#x662F;&#x7528;&#x767E;&#x5206;&#x6BD4;</li>
<li>PRI&#xFF1A;&#x4F18;&#x5148;&#x7EA7;</li>
<li>NI&#xFF1A;nice&#x503C;</li>
<li>ADDR/SZ/WCHAN&#xFF1A;&#x90FD;&#x4E0E;&#x5185;&#x5B58;&#x6709;&#x5173;</li>
<li>TTY&#xFF1A;&#x767B;&#x9646;&#x8005;&#x7684;&#x7EC8;&#x7AEF;&#xFF0C;&#x548C;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x8131;&#x4E0D;&#x5F00;&#x5E72;&#x7CFB;</li>
<li>TIME&#xFF1A;&#x5360;&#x7528;CPU&#x65F6;&#x95F4;</li>
<li>CMD&#xFF1A;&#x9020;&#x6210;&#x6B64;&#x8FDB;&#x7A0B;&#x7684;&#x547D;&#x4EE4;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x628A;&#x4E3B;&#x8981;&#x8FDB;&#x7A0B;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;</p>
<p>&#x200B;    <strong>1.I/O&#x6D88;&#x8017;&#x578B;&#x8FDB;&#x7A0B;&#xFF1B;</strong></p>
<p>&#x200B;    <strong>2.&#x5904;&#x7406;&#x5668;&#x6D88;&#x8017;&#x578B;&#x8FDB;&#x7A0B;</strong></p>
<p>&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x65E2;&#x662F;I/O&#x6D88;&#x8017;&#x578B;&#x4E5F;&#x662F;&#x5904;&#x7406;&#x5668;&#x6D88;&#x8017;&#x578B;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>I/O&#x6D88;&#x8017;&#x578B;&#x8FDB;&#x7A0B;&#x5982;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E00;&#x6837;&#xFF0C;&#x8F6E;&#x5230;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x628A;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x6D88;&#x8017;&#x5728;I/O&#x8BF7;&#x6C42;&#x548C;&#x7B49;&#x5F85;I/O&#x4E0A;&#xFF0C;&#x771F;&#x6B63;&#x4F7F;&#x7528;CPU&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x5C11;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x6D88;&#x8017;&#x6027;&#x8FDB;&#x7A0B;&#x4F1A;&#x628A;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x7528;&#x5728;&#x4F7F;&#x7528;CPU&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x8FD9;&#x4E24;&#x79CD;&#x7EE7;&#x627F;&#x5206;&#x914D;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x957F;&#x5EA6;&#x76F8;&#x7B49;&#xFF0C;&#x5C31;&#x4F1A;&#x4F53;&#x73B0;&#x51FA;&#x4E0D;&#x516C;&#x5E73;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x60F3;&#x7ED9;&#x5904;&#x7406;&#x5668;&#x6D88;&#x8017;&#x578B;&#x7684;&#x8FDB;&#x7A0B;&#x591A;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x7ED9;I/O&#x6D88;&#x8017;&#x6027;&#x8FDB;&#x7A0B;&#x5C11;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#xFF0C;&#x4E8E;&#x662F;linux&#x91C7;&#x53D6;&#x7684;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x6539;&#x8FDB;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;CFS&#x3002;</p>
<p><strong>Linux&#x7CFB;&#x7EDF;&#x662F;&#x62A2;&#x5360;&#x5F0F;&#x7684;</strong>&#xFF0C;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;&#x5462;&#xFF0C;&#x7CFB;&#x7EDF;&#x5F53;&#x524D;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FDB;&#x7A0B;&#x7A81;&#x7136;&#x5F97;&#x5230;&#x67D0;&#x79CD;&#x8D44;&#x6E90;&#x8FDB;&#x5165;&#x4E86;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x5C31;&#x6765;&#x5230;cpu&#x9762;&#x524D;&#x4E00;&#x811A;&#x8E22;&#x5F00;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#xFF08;&#x4F60;&#x594F;&#x51EF;&#xFF0C;&#x6211;&#x5148;&#x6765;&#xFF09;&#x5C31;&#x62A2;&#x593A;&#x4E86;&#x4E0E;CPU&#x5171;&#x5EA6;&#x7684;&#x7F8E;&#x597D;&#x65F6;&#x5149;&#x3002;</p>
<p><strong>CFS&#x76F4;&#x63A5;&#x5206;&#x914D;&#x7684;&#x4E0D;&#x662F;&#x65F6;&#x95F4;&#x7247;&#xFF0C;&#x800C;&#x662F;CPU&#x4F7F;&#x7528;&#x6BD4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x4F1A;&#x53D7;&#x5230;nice&#x503C;&#x5F97;&#x5F71;&#x54CD;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x61C2;&#xFF0C;nice&#x503C;&#x4F4E;&#x6BD4;&#x91CD;&#x5C31;&#x9AD8;&#xFF0C;nice&#x9AD8;&#x6BD4;&#x91CD;&#x5C31;&#x4F4E;</strong>&#x3002;</p>
<hr>
<p><strong>Q&#xFF1A;</strong>Linux&#x4F7F;&#x7528;&#x7684;CFS&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x51B3;&#x5B9A;&#x62A2;&#x5360;&#x65F6;&#x673A;&#x7684;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x8BF4;&#x7684;CPU&#x4F7F;&#x7528;&#x6BD4;&#xFF0C;&#x6CE8;&#x610F;&#xFF01;<strong>&#x53CD;&#x800C;CPU&#x4F7F;&#x7528;&#x6BD4;&#x4F4E;&#x7684;&#x65B0;&#x8FDB;&#x7A0B;&#x4F1A;&#x7ACB;&#x523B;&#x6295;&#x5165;&#x8FD0;&#x884C;&#xFF0C;CPU&#x4F7F;&#x7528;&#x6BD4;&#x9AD8;&#x7684;&#x65B0;&#x8FDB;&#x7A0B;&#x4F1A;&#x5EF6;&#x8FDF;&#x8FD0;&#x884C;</strong>&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p><strong>A&#xFF1A;</strong>&#x56E0;&#x4E3A;<strong>CFS&#x7684;&#x51FA;&#x53D1;&#x70B9;</strong>&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x6982;&#x5FF5;&#xFF1A;<strong>&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x7684;&#x6548;&#x679C;&#x5E94;&#x5982;&#x540C;&#x7CFB;&#x7EDF;&#x5177;&#x5907;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x4E2D;&#x7684;&#x5B8C;&#x7F8E;&#x591A;&#x4EFB;&#x52A1;&#x5904;&#x7406;&#x5668;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x4E2D;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5C06;&#x80FD;&#x83B7;&#x5F97;1/n&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;</strong>&#x3002;&#x5C31;&#x662F;&#x8BF4;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;<strong>&#x771F;&#x6B63;&#x4F7F;&#x7528;cpu&#x7684;&#x65F6;&#x95F4;</strong>&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5305;&#x62EC;I/O&#x6D88;&#x8017;&#x578B;&#x548C;&#x5904;&#x7406;&#x5668;&#x6D88;&#x8017;&#x578B;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x771F;&#x6B63;&#x7684;&#x516C;&#x5E73;&#xFF0C;&#x8FD9;&#x5C31;&#x89E3;&#x91CA;&#x4E86;&#x521A;&#x624D;&#x7684;&#x95EE;&#x9898;&#xFF0C;CPU&#x4F7F;&#x7528;&#x6BD4;&#x4F4E;&#x7684;&#x5360;&#x7528;&#x65F6;&#x95F4;&#x4F1A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x5C11;&#x4E8E;&#x5360;&#x7528;&#x6BD4;&#x9AD8;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x53EA;&#x597D;&#x8BA9;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x5177;&#x6709;&#x62A2;&#x5360;&#x80FD;&#x529B;&#xFF0C;&#x4E00;&#x5C31;&#x7EEA;&#x5C31;&#x53EF;&#x4EE5;&#x62A2;&#x5360;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x201C;<strong>&#x770B;&#x8D77;&#x6765;</strong>CPU&#x4F7F;&#x7528;&#x6BD4;&#x9AD8;&#x4E86;&#x201D;&#xFF08;&#x5176;&#x5B9E;&#x6CA1;&#x53D8;&#xFF09;&#x201C;<strong>&#x770B;&#x8D77;&#x6765;</strong>CPU&#x5360;&#x7528;&#x65F6;&#x95F4;&#x4E5F;&#x548C;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x4E00;&#x6837;&#x591A;&#x4E86;&#x201D;&#xFF08;&#x5176;&#x5B9E;&#x4E0D;&#x591A;&#xFF09;&#x3002;<strong>&#x62A2;&#x5360;&#x80FD;&#x529B;&#x9AD8;&#x4E86;&#xFF0C;&#x4EA4;&#x4E92;&#x6027;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x5C31;&#x597D;&#x4E86;</strong>&#xFF0C;&#x4F60;&#x770B;&#x4F60;&#x4EBA;&#x6253;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x4EA4;&#x4E92;&#x6027;&#x5C31;&#x5F97;&#x9AD8;&#xFF0C;&#x4E0D;&#x7136;&#x4F60;&#x6309;&#x4E2A;&#x952E;&#x653E;&#x4E2A;&#x6280;&#x80FD;&#x7535;&#x8111;&#x4E0D;&#x7ED9;&#x4F60;&#x5904;&#x7406;&#xFF0C;&#x4F60;&#x5C31;&#x5751;&#x961F;&#x53CB;&#x4E86;&#x3002;</p>
<ul>
<li><p><strong>Linux&#x5BF9;&#x666E;&#x901A;&#x8FDB;&#x7A0B;&#x91C7;&#x7528;&#x7684;&#x662F;&#x5B8C;&#x5168;&#x516C;&#x5E73;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF08;CFS&#xFF09;</strong></p>
</li>
<li><p>Linux&#x7684;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x5E76;&#x672A;&#x4F7F;&#x7528;&#x76F4;&#x63A5;&#x5747;&#x5206;&#x65F6;&#x95F4;&#x7247;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x5BF9;&#x4F18;&#x5148;&#x7EA7;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x8FDB;&#xFF0C;<strong>&#x91C7;&#x7528;&#x4E86;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x8303;&#x56F4;&#xFF0C;&#x4E00;&#x79CD;&#x662F;nice&#x503C;&#xFF0C;&#x8303;&#x56F4;&#x662F;-20&#x5230;+19&#xFF0C;&#x8D8A;&#x5927;&#x7684;nice&#x503C;&#x610F;&#x5473;&#x7740;&#x66F4;&#x4F4E;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4F4E;nice&#x503C;&#x7684;&#x8FDB;&#x7A0B;&#x4F1A;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#xFF08;&#x6309;&#x6BD4;&#x4F8B;&#x83B7;&#x5F97;&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x8303;&#x56F4;&#x662F;&#x5B9E;&#x65F6;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5176;&#x503C;&#x662F;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x7684;&#x53D8;&#x5316;&#x8303;&#x56F4;&#x662F;&#x4ECE;0&#x5230;99&#xFF0C;&#x4E0E;nice&#x503C;&#x610F;&#x4E49;&#x76F8;&#x53CD;&#xFF0C;&#x8D8A;&#x9AD8;&#x7684;&#x5B9E;&#x65F6;&#x4F18;&#x5148;&#x7EA7;&#x6570;&#x503C;&#x610F;&#x5473;&#x7740;&#x8FDB;&#x7A0B;&#x4F18;&#x5148;&#x7EA7;&#x8D8A;&#x9AD8;&#xFF0C;&#x4EFB;&#x4F55;&#x5B9E;&#x65F6;&#x8FDB;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x90FD;&#x9AD8;&#x4E8E;&#x666E;&#x901A;&#x8FDB;&#x7A0B;</strong></p>
<ul>
<li><strong>PS&#xFF1A;nice&#x503C;&#x8FD8;&#x4F1A;&#x4E0D;&#x65AD;&#x5BF9;old&#x4F18;&#x5148;&#x7EA7;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;nice&#x7684;&#x503C;&#xFF0C;nice&#x503C;&#x7ED9;&#x8D1F;&#x503C;&#x5FC5;&#x987B;&#x8981;&#x7528;root</strong></li>
</ul>
</li>
<li><p><strong>nice&#x503C;&#x4E0D;&#x662F;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4F46;&#x4F1A;&#x5F71;&#x54CD;&#x4F18;&#x5148;&#x7EA7; PRI(new)=PRI(old)+nice</strong></p>
</li>
<li><p><strong>&#x65F6;&#x95F4;&#x7247;&#x8FC7;&#x957F;&#x4F1A;&#x5BFC;&#x81F4;&#x4EBA;&#x673A;&#x4EA4;&#x4E92;&#x6B20;&#x4F73;&#xFF0C;&#x800C;&#x65F6;&#x95F4;&#x7247;&#x8FC7;&#x77ED;&#x4F1A;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x8FDB;&#x7A0B;&#x7684;&#x5207;&#x6362;&#x4E0A;</strong>&#xFF0C;&#x800C;&#x4E14;I/O&#x6D88;&#x8017;&#x578B;&#x8FDB;&#x7A0B;&#x548C;&#x5904;&#x7406;&#x5668;&#x6D88;&#x8017;&#x578B;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#x7684;&#x4E0D;&#x516C;&#x5E73;&#x4E4B;&#x5904;&#x4E5F;&#x663E;&#x73B0;&#x51FA;&#x6765;&#x4E86;</p>
</li>
<li><p>CFS&#x5E76;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x65F6;&#x95F4;&#x7247;&#x5230;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5904;&#x7406;&#x5668;&#x7684;&#x4F7F;&#x7528;&#x6BD4;&#x5212;&#x5206;&#x7ED9;&#x4E86;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x8FD8;&#x4F1A;&#x53D7;&#x5230;nice&#x503C;&#x7684;&#x5F71;&#x54CD;</p>
</li>
<li>CFS&#x7684;&#x505A;&#x6CD5;&#x662F;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5FAA;&#x73AF;&#x8F6E;&#x8F6C;&#xFF0C;<strong>&#x9009;&#x62E9;&#x8FD0;&#x884C;&#x6700;&#x5C11;&#x7684;&#x8FDB;&#x7A0B;&#x4F5C;&#x4E3A;&#x5199;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x6839;&#x636E;nice&#x503C;&#x7684;&#x542B;&#x4E49;-&#x5360;&#x7528;&#x5904;&#x7406;&#x5668;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x6765;&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5168;&#x90E8;&#x53EF;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x603B;&#x6570;&#x6765;&#x6839;&#x636E;&#x6240;&#x5360;&#x6BD4;&#x4F8B;&#x7684;&#x201C;&#x65F6;&#x95F4;&#x7247;&#x201D;&#x8FD0;&#x884C;</li>
<li><strong>linux&#x8BBE;&#x8BA1;&#x603B;&#x662F;&#x60F3;&#x5206;&#x914D;&#x7ED9;N&#x4E2A;&#x8FDB;&#x7A0B;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x540C;&#x6837;&#x591A;&#x7684;&#x5904;&#x7406;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#x95F4;</strong>&#xFF0C;&#x5F53;N&#x8D8B;&#x4E8E;&#x65E0;&#x7A77;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6309;&#x7406;&#x8BF4;&#x662F;<strong>&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x7ED9;&#x65E0;&#x9650;&#x5C0F;&#x7684;&#x65F6;&#x95F4;&#x5468;&#x671F;</strong>&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x4F1A;&#x5F88;&#x7CDF;&#x7CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x65E0;&#x6CD5;&#x5206;&#x914D;&#x65E0;&#x9650;&#x5C0F;&#x7684;&#x65F6;&#x95F4;&#x5468;&#x671F;&#xFF0C;<strong>&#x867D;&#x7136;&#x8D8A;&#x5C0F;&#x7684;&#x65F6;&#x95F4;&#x5468;&#x671F;&#x53EF;&#x4EE5;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x4EA4;&#x4E92;&#x6027;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x5E26;&#x6765;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x5207;&#x6362;&#x6D88;&#x8017;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;<strong>&#x76EE;&#x6807;&#x5EF6;&#x8FDF;</strong>&#xFF0C;&#x6765;&#x6A21;&#x62DF;&#x65E0;&#x9650;&#x5C0F;&#x8C03;&#x5EA6;&#x5468;&#x671F;&#x7684;&#x8FD1;&#x4F3C;&#x503C;&#xFF0C;&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x76EE;&#x6807;&#x5EF6;&#x8FDF;&#x5C31;&#x662F;20ms&#xFF0C;&#x7528;&#x5B83;&#x9664;&#x4EE5;&#x6240;&#x6709;&#x5F53;&#x524D;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x76EE;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x83B7;&#x5F97;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x957F;&#x5EA6;&#xFF0C;&#x5F53;&#x8FDB;&#x7A0B;&#x6570;&#x65E0;&#x9650;&#x5927;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x8D8B;&#x4E8E;&#x65E0;&#x9650;&#x5C0F;&#xFF0C;&#x5F88;&#x597D;&#xFF0C;&#x8FDB;&#x7A0B;&#x5207;&#x6362;&#x53C8;&#x7206;&#x70B8;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x628A;&#x6700;&#x5C0F;&#x503C;&#x8BBE;&#x4E3A;&#x4E3A;1ms&#x5462;&#xFF0C;&#x8FDB;&#x7A0B;&#x6570;&#x76EE;&#x518D;&#x591A;&#x6211;&#x4E5F;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x88AB;&#x5F3A;&#x5360;&#x4E4B;&#x524D;&#x83B7;&#x5F97;1ms&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;1ms&#x5C31;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6700;&#x5C0F;&#x7C92;&#x5EA6;</strong></li>
</ul>
<p><strong>&#x7136;&#x800C;&#x6700;&#x540E;&#x5F71;&#x54CD;CFS&#x8C03;&#x5EA6;&#x5668;&#x8C03;&#x5EA6;&#x8FDB;&#x7A0B;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x4F18;&#x5148;&#x7EA7;&#x7684;nice&#x503C;</strong>&#xFF0C;&#x56E0;&#x4E3A;CFS&#x8BF4;&#x4E86;&#xFF0C;&#x6211;&#x8981;&#x8BA9;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x83B7;&#x5F97;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF08;&#x867D;&#x7136;&#x4E0D;&#x53EF;&#x80FD;&#xFF09;&#xFF0C;<strong>&#x6240;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;vruntime&#x7684;&#x503C;&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x865A;&#x62DF;&#x65F6;&#x95F4;&#xFF08;&#x5C31;&#x662F;&#x5728;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8DD1;&#x7684;&#x65F6;&#x95F4;&#x7D2F;&#x52A0;&#x548C;&#xFF09;</strong>&#xFF0C;<strong>&#x8FD9;&#x4E2A;vruntime&#x503C;&#x8D8A;&#x5C0F;&#xFF0C;&#x8BF4;&#x660E;&#x8BE5;&#x8FDB;&#x7A0B;&#x5E94;&#x8BE5;&#x88AB;&#x4F18;&#x5148;&#x6267;&#x884C;&#xFF08;&#x6216;&#x8005;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#x7247;&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x997F;&#x4E86;&#x3002;&#x3002;&#x3002;</p>
<p><strong>&#x4E00;&#x6B21;&#x8C03;&#x5EA6;&#x95F4;&#x9694;&#x7684;&#x865A;&#x62DF;&#x8FD0;&#x884C;&#x65F6;&#x95F4;=&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x65F6;&#x95F4;*&#xFF08;NICE_0_LOAD/&#x6743;&#x91CD;&#xFF09;&#x8FD9;&#x5C31;&#x662F;nice&#x503C;&#x548C;vruntime&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;NICE_0_LOAD&#x662F;nice&#x4E3A;0&#x65F6;&#x7684;&#x6743;&#x91CD;</strong></p>
<p><strong>&#x5F53;nice&#x503C;&#x4E3A;0&#x8BC1;&#x660E;&#x865A;&#x62DF;&#x8FD0;&#x884C;&#x65F6;&#x95F4;=&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x65F6;&#x95F4;</strong></p>

<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style></body></html>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="task_struct.html" class="navigation navigation-next navigation-unique" aria-label="Next page: task_struct">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"nice","level":"1.1.1.3.1","depth":4,"next":{"title":"task_struct","level":"1.1.1.3.2","depth":4,"path":"实验一/资料/task_struct.md","ref":"实验一/资料/task_struct.md","articles":[]},"previous":{"title":"参考资料","level":"1.1.1.3","depth":3,"ref":"","articles":[{"title":"nice","level":"1.1.1.3.1","depth":4,"path":"实验一/资料/nice.md","ref":"实验一/资料/nice.md","articles":[]},{"title":"task_struct","level":"1.1.1.3.2","depth":4,"path":"实验一/资料/task_struct.md","ref":"实验一/资料/task_struct.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["donate","chapter-fold","back-to-top-button","code","-lunr","-search","search-pro","splitter","-sharing","sharing-plus","popup","lightbox","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"pluginsConfig":{"chapter-fold":{}},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"code":{"copyButtons":true},"donate":{"alipay":"https://ws3.sinaimg.cn/large/005BYqpgly1g2chablu88g30c90c9e81.jpg","alipayText":"更多精彩","button":"提问","title":"","wechat":"https://ws3.sinaimg.cn/large/005BYqpgly1g2chnfd4c2g309i09ikcz.jpg","wechatText":"QQ 提问"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"lightbox":{"jquery":true},"back-to-top-button":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":false,"facebook":false,"weibo":true,"twitter":false,"pocket":false,"google":true,"qzone":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Bre Athy","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":" 呼吸君のGitBook ","language":"zh-hans","links":{"sidebar":{"Home":"https://www.zhihu.com/people/you-yi-shi-de-hu-xi/activities"}},"gitbook":"*","description":"Linux实验"},"file":{"path":"实验一/资料/nice.md","mtime":"2019-04-04T07:58:49.812Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-04-25T06:28:13.722Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lightbox/jquery.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lightbox/lightbox.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

